# Brewfile — personal Mac
#
# Hand-maintained. Owns the macOS-only layer: casks, fonts, Mac App
# Store apps, and formulae that are better from Homebrew (git, neovim,
# zsh plugins). Cross-platform CLI tools live in mise instead
# (mise/.config/mise/config.toml).
#
# Apply with: brew bundle --file Brewfile
# Prune drift with: brew bundle cleanup --file Brewfile

# Taps
tap "FelixKratz/formulae" # borders
tap "nikitabobko/tap" # aerospace
tap "noahgorstein/tap" # jqp

# Formulae
brew "ast-grep"
brew "bat"
brew "bats-core"
brew "borders"
brew "bpytop"
brew "docker"
brew "eza"
brew "fx"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "httpie"
brew "hyperfine"
brew "jqp"
brew "markdownlint-cli"
brew "markdownlint-cli2"
brew "mas"
brew "mise"
brew "ncdu"
brew "neovim"
brew "nushell"
brew "openssh"
brew "ranger"
brew "shellcheck"
brew "sk"
brew "sshs"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "visidata"
brew "wget"
brew "xh"
brew "yamllint"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "alfred"
cask "brave-browser"
cask "claude"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "microsoft-teams"
cask "netnewswire"
cask "obsidian"
cask "pearcleaner"
cask "spotify"

# Mac App Store
mas "Copy 'Em", id: 876540291
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "NightShift", id: 1561604170
mas "Paste", id: 967805235
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "WhatsApp", id: 310633997
