homebrew/cask/1password-cli
act
automake
azure-cli
bat
bats-core
bpytop
brew-cask-completion
brew-gem
eza
fd
homebrew/cask/font-jetbrains-mono-nerd-font
fzf
gh
jq
karabiner-elements
kitty
lazygit
midnight-commander
ncdu
neovim
pulumi
ranger
ripgrep
rust
shellcheck
sk
starship
stow
the_silver_searcher
tmux
trivy
wget
xh
yamllint
yarn
yq
zoxide
zsh-autosuggestions
zsh-syntax-highlighting
