# Generated by scripts/generate-brewfile.sh
# Source configs: shared/shell shared/git shared/search shared/file-tools shared/data-tools shared/network shared/neovim host/common host/personal focus/containers focus/kubernetes focus/vscode focus/cloud focus/ai focus/typescript focus/productivity

# Homebrew taps
tap "FelixKratz/formulae"
tap "azure/functions"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "steipete/tap"
tap "steveyegge/beads"

# Homebrew formulae
brew "arkade"
brew "ast-grep"
brew "awscli"
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "bat"
brew "bats-core"
brew "bd"
brew "biome"
brew "borders"
brew "bpytop"
brew "docker"
brew "eza"
brew "fx"
brew "fzf"
brew "gemini-cli"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitkraken-cli"
brew "httpie"
brew "hyperfine"
brew "jqp"
brew "llm"
brew "markdownlint-cli"
brew "markdownlint-cli2"
brew "mas"
brew "mise"
brew "ncdu"
brew "neovim"
brew "nushell"
brew "openssh"
brew "pre-commit"
brew "ranger"
brew "shellcheck"
brew "sk"
brew "sshs"
brew "stow"
brew "swc"
brew "the_silver_searcher"
brew "tmux"
brew "typescript"
brew "visidata"
brew "wget"
brew "xh"
brew "yamllint"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Homebrew casks
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "alfred"
cask "brave-browser"
cask "claude"
cask "codex-app"
cask "codexbar"
cask "droid"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "hey-desktop"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "netnewswire"
cask "obsidian"
cask "pearcleaner"
cask "spotify"
cask "visual-studio-code"

